fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРабот</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Тогда
#Область ПрограммныйИнтерфейс
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРА ЗаполнитьГрафик
// Назначение: Автоматическое заполнение производственного календаря на указанный период
//             на основе переданных выходных дней
//
// Алгоритм:
// 1. Создаётся набор записей регистра сведений "ВКМ_ГрафикРабот"
// 2. Устанавливаются отборы по графику и периоду
// 3. Выполняется чтение существующих записей
// 4. Удаляются все старые записи за указанный период (для перезаполнения)
// 5. Для каждой даты в диапазоне создаётся новая запись
// 6. Для каждой даты определяется, является ли день выходным, и устанавливается значение:
//    - 0 - выходной день
//    - 1 - рабочий день 
// 7. Записи сохраняются в регистр
//
// Параметры:
//   ДатаНачала    (Дата) - начальная дата периода заполнения
//   ДатаОкончания (Дата) - конечная дата периода заполнения
//   ВыходныеДни   (Строка) - номера выходных дней (например: "6,7" - суббота и воскресенье)
//
// Замечания:
//   - ДеньНедели возвращает значения: 1-пн, 2-вт, 3-ср, 4-чт, 5-пт, 6-сб, 7-вс
//   - При проверке выходных дней используется поиск подстроки с разделителями-запятыми
//   - Значение рабочего дня (1) соответствует 8-часовому рабочему дню
//   - При необходимости можно изменить значение рабочего дня на 8 (для учёта в часах)
//
////////////////////////////////////////////////////////////////////////////////
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт

	Набор = РегистрыСведений.ВКМ_ГрафикиРабот.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	Набор.Прочитать();
	Набор.Очистить();
	
	Дат = ДатаНачала;
	
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
			Продолжить;
		ИначеЕсли Запись.Дата = Дат Тогда
			 Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			 	Запись.Значение = 0;
			 Иначе
			 	Запись.Значение = 1;
			 КонецЕсли;
			 Дат = Дат + 86400;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
				НоваяЗапись.Дата = Дат;
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.Значение = 0;
				Иначе
					НоваяЗапись.Значение = 1;
				КонецЕсли;
				Дат = Дат + 86400;
			КонецЦикла;
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.Значение = 0;
				Иначе
					Запись.Значение = 1;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + 86400;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ГрафикРаботы = ГрафикРаботы;
		Запись.Дата = Дат;
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.Значение = 0;
		Иначе
			Запись.Значение = 1;
		КонецЕсли;
		Дат = Дат + 86400;
	КонецЦикла;
	
	Набор.Записать();
КонецПроцедуры

#КонецОбласти
#КонецЕсли
